package com.example.myapp.bean;

import com.example.myapp.R;

import java.util.ArrayList;
import java.util.List;

/**
 * Author zhangdongwei
 */
public class ShopMedicalUtils {
    public  static  String[] food = { "阿司匹林", "去痛片", "消炎痛", "扑热息痛", "复方对乙酰氨基酚片", "新康泰克",
            "白加黑", "双黄连", "克咳胶囊", "蛇胆川贝液", "复方甘草片", "阿莫西林", "头孢拉定 ", "环丙沙星", "吗丁啉",
            "健胃消食片", "泻立停", "氟哌酸", "扑尔敏片", "息斯敏", "乙醇", "碘酒", "高锰酸钾", "茶苯海明", "创可贴", "纱布"};
    public static  String[] food1 = { "解热镇痛药", "解热镇痛药", "解热镇痛药", "解热镇痛药",
            "解热镇痛药", "感冒类药", "感冒类药", "感冒类药", "止咳化痰药", "止咳化痰药", "止咳化痰药",
            "抗菌药物", "抗菌药物", "抗菌药物 ", "助消化药", "助消化药",
            "止泻药", "止泻药 ", "抗过敏药", "抗过敏药",
            "外用消毒药", "外用消毒药", "外用消毒药", "晕动药", "其他", "其他"};
    public static  int[] resId = { R.mipmap.pork, R.mipmap.pigliver, R.mipmap.pigblood,
            R.mipmap.lamb, R.mipmap.beef, R.mipmap.beefliver,
            R.mipmap.goose, R.mipmap.rabbit, R.mipmap.dog,
            R.mipmap.duck, R.mipmap.chicken, R.mipmap.donkey,
            R.mipmap.egg, R.mipmap.carp, R.mipmap.yellowfish,
            R.mipmap.shrimp, R.mipmap.shrimp2, R.mipmap.crab,
            R.mipmap.clam, R.mipmap.turtle, R.mipmap.riversnail,
            R.mipmap.garlic, R.mipmap.onion, R.mipmap.radish,
            R.mipmap.celery, R.mipmap.leek };
    public static  String [] foodjianjie={"阿司匹林缓解轻度或中度疼痛，如牙痛、头痛、神经痛、肌肉酸痛及痛经效果较好，亦用于感冒、 流感等发热疾病的退热，治疗风湿痛等。近年来发现阿司匹林对血小板聚集有抑制作用，能阻止血栓形成。"
            ,"去痛片为一复方解热镇痛药。其中氨基比林和非那西丁能抑制下视丘前列腺素的合成和释放，恢复体温调节中枢感受神经元的正常反应性而起退热作用；同时还通过抑制前列腺素等的合成而起镇痛作用。稳定溶酶体酶，影响吞噬细胞的吞噬作用而起到抗炎作用。"
            ,"消炎痛适用于解热、缓解炎性疼痛作用明显，故可用于急、慢性风湿性关节炎、痛风性关节炎及癌性疼痛（西药类癌痛药）；也可用于滑囊炎、腱鞘炎及关节囊炎等；能抗血小板聚集，故可防止血栓形成，但疗效不如乙酰水杨酸；治疗Behcet综合征，退热效果好。",
            "扑热息痛扑热息痛，商品名称有百服宁、必理通、泰诺、醋氨酚等。该品国际非专有药名为Paracetamol。它是最常用的非抗炎解热镇痛药，解热作用与阿司匹林相似，镇痛作用较弱，无抗炎抗风湿作用，是乙酰苯胺类药物中最好的品种。特别适合于不能应用羧酸类药物的病人。",
            "复方对乙酰氨基酚片(Ⅱ)，适应症为用于普通感冒或流行性感冒引起的发热，也用于缓解轻至中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。",
            "新康泰克为缓解感冒症状的复方制剂。其中盐酸伪麻黄碱为拟肾上腺素药，具有收缩上呼吸道毛细血管，消除鼻咽部粘膜充血，减轻鼻塞症状的作用；马来酸氯苯那敏为抗组胺药，能进一步减轻感冒引起的鼻塞、流涕、打喷嚏等症状。本品内容物中既含有速释小丸。"
            ,"白加黑感冒药它主要治疗和减轻普通感冒以及流行性感冒引起的发热、头痛、四肢酸痛、喷嚏、流鼻涕、以及鼻塞、咳嗽等症状。该药物它含有扑热息痛、伪麻黄碱、氨溴索、右美沙芬、夜片中含有苯海拉明这个药物。",
            "双黄连是由金银花、黄芩、连翘组成，具有疏风解表，清热解毒的功效，用于外感风热所致的感冒，症见发热、咳嗽、咽痛。市面常见剂型有颗粒剂、口服液、注射液等。",
            "克咳胶囊，止嗽，定喘．祛痰。用于咳嗽，喘急气短。本品为胶囊剂，内容物为棕黄色的粉末或颗粒，味微苦。",
            "蛇胆川贝液，祛风止咳，除痰散结。用于风热咳嗽，痰多，气喘，胸闷，咳痰不爽或久咳不止。本品为浅黄色至浅黄棕色的澄清液体，味甜、微苦，有凉喉感。",
            "复方甘草片，用于镇咳祛痰。本品为复方制剂，其组份为每片含甘草浸膏粉112.5毫克、阿片粉4毫克、樟脑2毫克、八角茴香油2毫克、苯甲酸钠2毫克。本品为棕色片；有特臭，味甜，易吸潮。",
            "阿莫西林，又名安莫西林或安默西林，是一种最常用的半合成青霉素类广谱β-内酰胺类抗生素，为一种白色粉末，半衰期约为61.3分钟。在酸性条件下稳定，胃肠道吸收率达90%。阿莫西林杀菌作用强，穿透细胞膜的能力也强。",
            "头孢拉定 （Cephradine, Velosef） 别名：先锋霉素Ⅵ、头孢菌素Ⅵ等。本品为第一代半合成头孢菌素，抗菌作用与头孢氨苄相似。本品耐酸可以口服，吸收好，血药浓度较高，特点是耐β内酰胺酶，对耐药性金葡菌及其它多种对广谱抗生素耐药的杆菌等有迅速而可靠的杀菌作用，主要以原形经尿排泄，尿中浓度较高。",
            "环丙沙星为合成的第三代喹诺酮类抗菌药物，具广谱抗菌活性，杀菌效果好，几乎对所有细菌的抗菌活性均较诺氟沙星及依诺沙星强2～4倍，对肠杆菌、绿脓杆菌、流感嗜血杆菌、淋球菌、链球菌、军团菌、金黄色葡萄球菌具有抗菌作用。",
            "吗丁啉(多潘立酮片)治疗由胃排空延缓、胃食道反流、食道炎引起的消化不良症。-上腹部胀闷感、腹胀、上腹疼痛；-暧气、肠胃胀气；-恶心、呕吐；-口中带有或不带有反流胃内容物的胃烧灼感。",
            "健胃消食片，中成药名。为消食剂，具有健胃消食之功效。主治脾胃虚弱所致的食积，症见不思饮食，嗳腐酸臭，脘腹胀满；消化不良见上述证候者。",
            "泻立停，即颠茄磺苄啶片，为类白色片，为复方制剂，含活性成份磺胺甲恶唑、甲氧苄啶、颠茄流浸膏。常用于治疗痢疾杆菌引起的慢性菌痢和其他敏感致病菌引起的肠炎等。",
            "氟哌酸又名诺氟沙星（Norfloxacin），为第三代喹诺酮类抗菌药，会阻碍消化道内致病细菌的DNA旋转酶（DNA Gyrase）的作用，阻碍细菌DNA复制，对细菌有抑制作用，是治疗肠炎痢疾的常用药。但此药对未成年人骨骼形成有延缓作用，会影响到发育，故禁止未成年人服用。",
            "扑尔敏片即马来酸氯苯那敏片，白色片剂，适用于皮肤过敏症：荨麻疹，湿疹，皮炎，药疹，皮肤瘙痒症，神经性皮炎，虫咬症，日光性皮炎，也可用于过敏性鼻炎，药物及食物过敏。主要不良反应为嗜睡、口渴、多尿、咽喉痛、困倦、虚弱感、心悸、皮肤瘀斑、出血倾向。",
            "息斯敏（氯雷他定片），适应症为本品用于治疗常年性和季节性过敏性鼻炎、过敏性结膜炎、慢性荨麻疹和其他过敏性反应症状及体征。",
            "乙醇在常温常压下是一种易燃、易挥发的无色透明液体，低毒性，纯液体不可直接饮用；具有特殊香味，并略带刺激；微甘，并伴有刺激的辛辣滋味。易燃，其蒸气能与空气形成爆炸性混合物，能与水以任意比互溶。能与氯仿、乙醚、甲醇、丙酮和其他多数有机溶剂混溶。",
            "碘酊又称为碘酒，为红棕色的液体，主要成分为碘、碘化钾。有碘与乙醇特臭。色泽随浓度增加而变深。适应症为用于皮肤感染和消毒。许多人认为碘酒只是打针或手术前消毒皮肤用的，其实这只是碘酒的用途之一。在日常生活中，碘酒可以用来治疗许多小毛病。",
            "高锰酸钾（Potassium permanganate）是一种强氧化剂，为黑紫色、细长的棱形结晶或颗粒，带蓝色的金属光泽，无臭，与某些有机物或易氧化物接触，易发生爆炸，溶于水、碱液，微溶于甲醇、丙酮、硫酸，分子式为KMnO4，分子量为158.034。熔点为240°C，但接触易燃材料可能引起火灾。",
            "茶苯海明本品为白色结晶性粉末；无臭。化学名为1,3-二甲基-8- 氯-3，7-二氢-1H-嘌呤-2，6-二酮-N，N-二甲基-2-（二苯基氧基）乙胺盐。按干燥品计算，含苯海拉明（C17H21NO）应为53.0%～55.5%。微溶于水，易溶于乙醇，难溶于苯及乙醚，见光色泽逐渐变深。是一种抗组胺类西药。",
            "创可贴是一长形胶布，中间附以浸过药物的纱布，用来贴在创口处从而起保护伤口，暂时止血，抵抗细菌再生，防止创口再次损伤的作用  。是医院、诊所、家庭中最常用的急救必备医疗用品。",
            "纱布，是一种经纬稀疏的棉织品。属纺织原料，布类，特点是稀疏，有明显的网格。纯棉纱布（也作全棉纱布），主要用于棉被、蚕丝被里料，包棉胎。也可脱脂后医用，上浆定型后工业用。"};



    public static List<MedicineBean> getAllFoodList(){
        List<MedicineBean>list=new ArrayList<>();
        for(int i=0;i<food.length;i++){
            MedicineBean bean=new MedicineBean(food[i],food1[i],foodjianjie[i],resId[i]);
            list.add(bean);
        }
        return list;
    }

}
